app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def dashboard
  	@blogs = Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
   	@blog = Blog.find params[:id]

INSERT INTO "blogs" ("name", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "testing"], ["subject", "asdf"], ["created_at", "2015-09-08 15:13:04.738376"], ["updated_at", "2015-09-08 15:13:04.738376"]]
---
   def create
   	#insert query
   	new_blog =Blog.create(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
  	@blog = Blog.find params[:id]

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "blogs" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["name", "rails _sandeep"], ["description", "testing"], ["updated_at", "2015-09-07 15:36:47.741323"], ["id", 1]]
---
	def update
		@blog = Blog.find params[:id]
		@blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 3]]
---
  def destroy
  	@blog = Blog.find params[:id]
  	@blog.destroy